// Файл для роботи з кольоровою темою

// =========================================================================
// setThemeLS(theme);
// Функція  - Встановити нову тему в LocalStorage
// Отримує  - символьне значення встановленої теми
// Повертає - нічого
// -------------------------------------------------------------------------
export function setThemeLS(theme) {
  localStorage.setItem('theme', theme);
}
// =========================================================================

// =========================================================================
// getThemeLS()
// Функція  - Отримання теми з LocalStorage
// Отримує  - нічого
// Повертає - символьне значення встановленої теми
// -------------------------------------------------------------------------
export function getThemeLS() {
  let themeCurrent = localStorage.getItem('theme');
  // Якщо схеми кольорів ще немає в LocalStorage, встановлюємо 'light' за замовчуванням
  if (themeCurrent === null) {
    themeCurrent = 'light';
    setThemeLS(themeCurrent);
  }
  return themeCurrent;
}
// =========================================================================

// =========================================================================
// setThemeBody(theme);
// Функція  - Встановити нову тему в body
// Отримує  - символьне значення встановленої теми
// Повертає - нічого
// -------------------------------------------------------------------------
export function setThemeBody(theme) {
  // Встановлюємо схему кольору - значення data-аргумента в body
  if (theme === 'dark') {
    document.body.setAttribute('data-theme', 'dark');
  } else {
    document.body.setAttribute('data-theme', 'light');
  }
}
// =========================================================================
